Revit 2026 API

# ImageInstanceWidth Property

---

The width of the ImageInstance.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Width { get; set; }
```
```vb
Public Property Width As Double
	Get
	Set
```
```cpp
public:
property double Width {
	double get ();
	void set (double value);
}
```
```fsharp
member Width : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given value for width results in a height that is more than 30000 feet because LockProportions is set to true. |
| ArgumentOutOfRangeException | When setting this property: The given value for width must be between 0 and 30000 feet. |

If LockProportions is true, then changes to the Width will also result in changes to the Height.

#### Reference

ImageInstance Class

Autodesk.Revit.DB Namespace